app/Filters/ApiKeyFilter.php

    public function before(RequestInterface $request, $arguments = null){
        $key = $request->getHeaderLine('x-api-key');
        if(empty($key)){
          //return Services::response()->setStatusCode(ResponseInterface::HTTP_FORBIDDEN, 'API Key required');
          $response = [
            'status' => 401,
            'message' => 'API Key required'
          ];
          return Services::response()->setJSON($response)->setStatusCode(ResponseInterface::HTTP_UNAUTHORIZED);
        }
        $db = \Config\Database::connect();
        $apiKey = $db->table('api_keys')->where('key', $key)->get()->getRow();
---
SELECT *
FROM `api_keys`
WHERE `key` = '7026082221db3e912944d138c5885030'